using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class readMePls : MonoBehaviour
{
    //อนิเมชั่นตัวละคร

    //ตัวละคร
    //    Idle = คน
    //    เดิน+กระโดด = แมว

    //มอน
    //    ผี = เดินไปมา
    //    ฟักทอง = อยู่เฉยๆ



    //ไอเทม
    //    แอปเปิ้ล = ไอเทมวิเศษซ่อนอยู่ในแมพ (ไม่บังคับเก็บ)
    //    ลูกอม = บังคับเก็บให้ครบ 3 อัน
    //พวกไอเทมจะทำลอยขึ้นลงหรืออยู่นิ่งๆก็ได้แล้วแต่


    //แพลตฟอร์มอันไหนที่ขยับดูใน map halloween design object มีเลื่อนแบบซ้าย-ขวากับ บน-ล่าง
    //สงสัยอันไหนหรืออันไหนอยากเปลี่ยนให้บอกก่อนทำ
}
